/*
 ============================================================================================
 ======================================== 其它 ================================================
 ============================================================================================
 
 =================================
 1.侧滑第三方API
 =================================
 #import "DDMenuController.h"
 支持ARC
 不用配置
 
 =================================
 2.上拉刷新下拉加载
 =================================
 #import "MJRefresh.h"
 支持ARC
 不用配置
 
 =================================
 3.ASIHttpRequst网络请求
 =================================
 #import "ASIHttpRequst.h"
 #import "ASINetworkQueue.h"
 不支持ARC -fno-objc-arc
 libz.dylib
 MobileCoreServices.framework
 SystemConfiguration.framework
 CFNetwork.framework
 libxml2.dylib
 header search paths /usr/include/libxml2
 
 =================================
 4.FMDatabase splite3
 =================================
 #import "FMDatabase.h"
 #import "FMResultSet.h"
 不支持ARC -fno-objc-arc
 libsqlite3.dylib
 
 =================================
 5.GDataXMLNode xml的Dom解析
 =================================
 #import "GDataXMLNode.h"
 不支持ARC -fno-objc-arc
 libxml2.dylib
 header search paths /usr/include/libxml2
 
 =================================
 6.SDWebImage 异步加载网络图片
 =================================
 #import "UIButton+WebCache.h"
 #import "UIImageView+WebCache.h"
 不支持ARC -fno-objc-arc
 不用配置
 
 =================================
 7.Umen 分享 UMSocial_Sdk_4.2
 =================================
 #import "UMSocial.h"
 支持ARC
 不用配置
 
 =================================
 8.百度地图
 =================================
 
 =================================
 9.3DES加密解密(DES3Util)
 =================================
 
 =================================
 10.AFNetworking网络请求
 =================================
 
 =================================
 11.AsyncSocket套接字
 =================================
 
 =================================
 12.效果集成(iCarousel)
 =================================
 
 
 =================================
 13.键盘自动弹出(IQKeyBoardManager)
 =================================
 
 
 =================================
 14.加载提示(MBProgressHUD)
 =================================
 
 
 =================================
 15.异步加载图片(SDWebImage)
 =================================
 
 =================================
 16.广告式滚动视频(SGKScrollView)
 =================================
 
 
 =================================
 17.自定义TabBarController(SGKTabBarController)
 =================================
 
 
 =================================
 18.友盟分享(UMSocial)
 =================================
 
 
 =================================
 19.xml转json(XMLDictionary) 
 =================================
 
 =================================
 20. 屏幕适配(第三方Masonry)
 =================================
 
 */